{
  "products": [
    {
      "id": 1,
      "productName": "HP Victus",
      "categoryId": "1",
      "description": "You can play your favourite games for an extended period of time on the HP Victus 15 Gaming Laptop. Thanks to its AMD Ryzen processor and dependable graphics card, this laptop provides an engrossing gaming experience. In addition, with its increased productivity, gaming, video editing, and 3D rendering, this laptop ensures optimal performance. Moreover, this laptop has up to 39.624 cm (15.6) screen and a backlit keyboard with a number pad and a touchpad, allowing you to experience high-performance gaming.",
      "price": "₹57,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/C18YdGwB/HP-victus.jpg",
      "rating": "4.3",
      "review": "250",
      "vendorName": "HP India",
      "warrenty": "1 Year"
    },
    {
      "id": 2,
      "productName": "HP Pavillion",
      "categoryId": "1",
      "description": "If you’re looking for a sleek yet powerful laptop that is perfect for, both, work and play, then you must buy the HP Pavilion Gaming 15 Laptop. Whether it's playing games or multitasking between applications, this laptop offers a smooth and lag-free performance as it features an AMD Ryzen 5-3550H processor and 8 GB of DDR4 RAM. Enjoy an immersive viewing experience, thanks to the 39.62-cm (15.6) Full HD display and dual speakers as well as B&O Audio.",
      "price": "₹59,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/dVWJfQW1/Hp-Pavillion.jpg",
      "rating": "4.4",
      "review": "150",
      "vendorName": "HP India",
      "warrenty": "1 Year"
    },
    {
      "id": 3,
      "productName": "HP 14s",
      "categoryId": "1",
      "description": "With this HP laptop, whose astounding features can stun you, you can enjoy seamless operation and elevate your visual experience. This laptop's stylish design and large 35.56 cm (14) display enable you to flaunt it wherever you go while still getting work done. Furthermore, your multitasking abilities reach the next level thanks to Intel Graphics and Processor. Moreover, you can benefit from lightning-fast data transfers and the exceptional performance of this laptop considering the SSD support of up to 256 GB.",
      "price": "₹37,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/jj5SqnWP/Hp-14s.jpg",
      "rating": "4.2",
      "review": "300",
      "vendorName": "HP India",
      "warrenty": "1 Year"
    },
    {
      "id": 4,
      "productName": "HP 15s",
      "categoryId": "1",
      "description": "Appreciate this HP laptop's smooth operations and strong performance, which is packed with innovative features. With the help of a graphics card and processor from Intel's 12th generation, you can easily perform at your peak. Additionally, this laptop's integrated 4G LTE configuration and USB connections enable you to do your tasks quickly. Fast-booting technology on this laptop also makes it possible for you to take everything you need with you. Moreover, because of its modest weight, it is portable and a fantastic travel companion.",
      "price": "₹59,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/6pBQSmtH/Hp-15s.jpg",
      "rating": "4.2",
      "review": "280",
      "vendorName": "HP India",
      "warrenty": "1 Year"
    },
    {
      "id": 5,
      "productName": "Lenovo Ideapad ",
      "categoryId": "2",
      "description": "You can get your work done in no time with the Lenovo IdeaPad Slim 3 Laptop. With its lightweight body sporting up to 19.9 mm of thinness, this laptop enables you to effortlessly carry it anywhere. Offering up to four-sided narrow bezels and a screen-to-body ratio of up to 88%, this laptop renders impactful visuals. In addition, it has a long battery life of up to 8 hours, so you can use it for long durations.",
      "price": "₹56,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/4xGKG3bQ/lenovo-ideapad.jpg",
      "rating": "4.2",
      "review": "320",
      "vendorName": "Lenovo India",
      "warrenty": "2 Year"
    },
    {
      "id": 6,
      "productName": "Lenovo Ideapad Gaming",
      "categoryId": "2",
      "description": "Unleash the gamer in you and always stay on top of your game with the Ideapad gaming laptop. Driven by an 11th Gen Intel i5 processor, and NVIDIA’s GPU setup, this laptop enables you to play games and enjoy each minute of your gaming session without any stutter. The 39.62 cm (15.6) FHD IPS display facilitates a near bezel-less visual experience and its fast refresh rate of 120 Hz allows you to enjoy the smooth operation of this laptop.",
      "price": "₹56,890",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/VNDm3fDv/lenovo-gaming.jpg",
      "rating": "4.1",
      "review": "270",
      "vendorName": "Lenovo India",
      "warrenty": "2 Year"
    },
    {
      "id": 7,
      "productName": "Lenovo Ideapad Flex",
      "categoryId": "2",
      "description": "Boasting an all-metal chassis and a sleek profile, the stylish Lenovo IdeaPad Flex 5 82HS00W6IN Laptop lets you work or play on the fly. You can comfortably use this laptop regardless of the angle, as it sports a flexible 360-degree hinge. Also, housing an Intel Core i3-1115G4 11th Gen processor, it allows you to quickly and smoothly complete your work. Furthermore, this laptop’s up to 8 GB of RAM and up to 512 GB of SSD storage further contribute to its seamless performance.",
      "price": "₹64,500",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/VvSfqx96/lenovo-flex.jpg",
      "rating": "4.4",
      "review": "230",
      "vendorName": "Lenovo India",
      "warrenty": "2 Year"
    },
    {
      "id": 8,
      "productName": "Lenovo Yoga",
      "categoryId": "2",
      "description": "Stay entertained while also being productive at work by bringing home this Yoga laptop from Lenovo. Featuring a range of impressive features, such as a powerful processor, large RAM capacity, large storage drive, and more, this laptop is sure to be your ideal computing companion, when you're at home or on the go.",
      "price": "₹1,17,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/jjkBHLMH/lenovo-yoga.jpg",
      "rating": "4.4",
      "review": "180",
      "vendorName": "Lenovo India",
      "warrenty": "2 Year"
    },
    {
      "id": 9,
      "productName": "Acer Aspire 7",
      "categoryId": "3",
      "description": "Experience flawless operation and incredible performance with the innovative Acer Aspire laptop that comes loaded with an array of memersing features. Powered by the innovative 12th Gen Intel Core processor and NVIDIA GeForce RTX 3050, you can effortlessly multitask and easily handle demanding tasks. Moreover, the 32 GB of DDR4 RAM and a high-speed 512 SSD allow you to conveniently cruise through challenging tasks and experience high-speed file transfer. Furthermore, With a 19.90 mm thin, angular aluminium chassis and an elevating hinge, this laptop has a subtle design that can make you the centre of attention wherever you go.",
      "price": "₹69,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/LsR8c0SC/accer-aspire7.jpg",
      "rating": "4.3",
      "review": "300",
      "vendorName": "Acer India",
      "warrenty": "1 Year"
    },
    {
      "id": 10,
      "productName": "Acer Predator",
      "categoryId": "3",
      "description": "If you are often left disappointed by your gaming experience, then you can check out the Acer Predator Helios 300 PH315-53 Gaming Laptop designed for immersive entertainment in every aspect. This device features a 39.6 cm (15.6) FHD IPS Display for rich visuals, Ray Tracing for visually intense games, and DTS X Ultra for clear and immersive sound on your headphones or speakers.",
      "price": "₹1,04,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/fyb36qcn/accer-predator.jpg",
      "rating": "4.5",
      "review": "350",
      "vendorName": "Acer India",
      "warrenty": "1 Year"
    },
    {
      "id": 11,
      "productName": "Acer Nitro",
      "categoryId": "3",
      "description": "The Acer Nitro 5 is a powerful gaming laptop that lets you take your gameplay to the next level. With impressive specs, a great 39.62 cm (15.6) FHD display with 144Hz refresh rate combined with powerful NVIDIA GeForce GTX 1650 graphics and more, the Nitro 5 helps you enhance your gaming experience. The laptop is powered by the 11th Generation Intel Core i5 processor that makes gaming, processing, and multitasking seamless. To top it off, you also get an option to expand the storage and RAM capacity to turn this highly efficient laptop into a monster gaming machine.",
      "price": "₹62,699",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/F1tPPSSS/acer-nitro.jpg",
      "rating": "4.6",
      "review": "320",
      "vendorName": "Acer India",
      "warrenty": "1 Year"
    },
    {
      "id": 12,
      "productName": "ASUS TUF Gaming F15 ",
      "categoryId": "4",
      "description": "Raise the thrill in every game and add a little style to your gaming setup with the Asus TUF Gaming F15 laptop. It is equipped with a 10th Gen Intel Core H-Series processor and GeForce GTX 1650 GPU so that you can experience fast-paced and smooth gaming. And, with the desktop-style Keyboard setup and integrated backlights, you can indulge in gaming for hours without getting bored.",
      "price": "₹49,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/Hkn2Q3RN/asus-tuf.jpg",
      "rating": "4.4",
      "review": "220",
      "vendorName": "Asus India",
      "warrenty": "1 Year"
    },
    {
      "id": 13,
      "productName": "ASUS Vivobook 15 ",
      "categoryId": "4",
      "description": "With its many wonderful features, the ASUS VivoBook 15 laptop provides perfect processing and outstanding performance. This laptop offers impressive speed and eye-catching graphics whether it is being used for work or leisure. Additionally, the ASUS VivoBook 15 laptop's Intel processor enables you to do tasks quickly and effectively. Furthermore, this laptop offers a large storage capacity in addition to a high data speed because of its dual storage configuration. On the HDD, you can store large data like movies, music collections, and photo albums, while you can simply load programmes on the SSD for fast response and loading times. Moreover, this laptop's wide-view display has an anti-glare coating to lessen distracting glare and reflections, allowing you to fully concentrate on what is in front of you.",
      "price": "₹53,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/MpfB6Lhz/asus-vivobook.jpg",
      "rating": "4.1",
      "review": "160",
      "vendorName": "Asus India",
      "warrenty": "1 Year"
    },
    {
      "id": 14,
      "productName": "ASUS ROG Strix G15",
      "categoryId": "4",
      "description": "You can enjoy an immersive and engaging gaming experience on the ASUS ROG Strix G15 Gaming Laptop. With its focused power, this laptop streamlines and enhances the gaming experience on Windows 11 Home. Gaming and smooth, rapid multitasking are made possible by this laptop's AMD Ryzen 4000H-Series CPU and GeForce RTX 30-series GPU. You can play fast esports on this laptop as its display has a refresh rate of up to 144 Hz. When running heavy applications, this laptop's advanced thermal innovations help keep it cool. And, its Adaptive-Sync helps enhance the overall gaming experience.",
      "price": "₹85,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/4xx8WX7B/asus-rog.jpg",
      "rating": "4.5",
      "review": "400",
      "vendorName": "Asus India",
      "warrenty": "1 Year"
    },
    {
      "id": 15,
      "productName": "DELL Inspiron",
      "categoryId": "5",
      "description": "Whether you want to work on your deadlines or perform simple computing tasks, the Dell Inspiron 3525 Laptop is an excellent choice. It offers quick and quiet performance with its advanced AMD CPUs and HDD or PCIe SSD options. This laptop is an exceptional option if you want to upgrade your graphics. Additionally, on this laptop, wide touchpads and keycaps are available to you, making it simple for you to navigate your content. Furthermore, the ComfortView software in this laptop reduces the damaging blue light emissions, keeping your eyes comfortable over extended viewing sessions.",
      "price": "₹52,490",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/Y0SkpJDR/dell-inspiron.jpg",
      "rating": "4.2",
      "review": "210",
      "vendorName": "DELL India",
      "warrenty": "1 Year"
    },
    {
      "id": 16,
      "productName": "DELL Vostro",
      "categoryId": "5",
      "description": "Bring home the Dell Vostro 3400 Thin and Light Laptop and immerse yourself in clear visuals and rich audio, thanks to its 35.56 cm (14) Full HD screen and inbuilt speakers. This laptop is capable of handling any task as it is equipped with an 11th Gen Intel Core i5 processor and 8 GB of DDR4 RAM. This laptop can recharge from 0% up to 80% within an hour, thanks to the ExpressCharge feature.",
      "price": "₹45,885",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/wBdpttb7/dell-vostro.jpg",
      "rating": "4.1",
      "review": "170",
      "vendorName": "DELL India",
      "warrenty": "1 Year"
    },
    {
      "id": 17,
      "productName": "DELL G7",
      "categoryId": "5",
      "description": "The Dell G7 7500 is a well-designed gaming laptop that comes with an innovative space-saving Origami Hinge. Its sleek looks are sure to make you the talk of the town. To enhance your gaming experience and take it to the next level, this laptop comes powered by 10th Gen Intel Core i9 processor and features an 8 GB NVIDIA GeForce RTX 2070 graphics card with Max-Q Design. To top it off, the laptop also features a neat, narrow-bezel FHD display that makes every image on it seem vivid and real.",
      "price": "₹2,06,490",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/KvgwnGTL/dell-g7.jpg",
      "rating": "4.3",
      "review": "190",
      "vendorName": "DELL India",
      "warrenty": "1 Year"
    },
    {
      "id": 18,
      "productName": "APPLE MacBook AIR M2",
      "categoryId": "6",
      "description": "Stylish & Portable Thin and Light Laptop. 13.6 Inch Liquid Retina Display, LED-backlit display with IPS technology, 500 nits brightness, Wide colour (P3), True Tone technology. Light Laptop without Optical Disk Drive",
      "price": "₹1,31,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/VvssJSvj/apple-mb-air.jpg",
      "rating": "4.5",
      "review": "200",
      "vendorName": "APPLE",
      "warrenty": "1 Year"
    },
    {
      "id": 19,
      "productName": "APPLE MacBook Pro M2 ",
      "categoryId": "6",
      "description": "Stylish & Portable Thin and Light Laptop,13.3 Inch Retina display, LED-backlit display with IPS technology, 500 nits brightness, Wide colour (P3), True Tone technology.Light Laptop without Optical Disk Drive",
      "price": "₹1,21,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/YqpLF9ZD/apple-mb-pro.jpg",
      "rating": "4.7",
      "review": "320",
      "vendorName": "APPLE",
      "warrenty": "1 Year"
    },
    {
      "id": 20,
      "productName": "MSI Katana GF66",
      "categoryId": "7",
      "description": "Unleash the ultimate power during every game play with the MSI Katana GF66 gaming laptop. This laptop is supported with an 11th Gen Intel Core i7 CPU processor and an NVIDIA GeForce RTX 30 series graphics card for enhanced gaming and smooth multitasking experience. Also, it is equipped with a dedicated thermal system for extended hours of gaming without worrying about the laptop getting heated up.",
      "price": "₹79,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/ZRdpwMxf/msi-katana.jpg",
      "rating": "4.3",
      "review": "210",
      "vendorName": "MSI India",
      "warrenty": "1 Year"
    },
    {
      "id": 21,
      "productName": "MSI Crosshair ",
      "categoryId": "7",
      "description": "Get immersed into a thrilling gaming experience with the MSI Crosshair 15 gaming laptop. Powered by a NVIDIA's 2nd gen RTX architecture and an NVIDIA GeForce RTX 3060 graphics card, this laptop renders striking graphics and enhanced computation performance. Also, it features a Cooler Boost 5 design to ensure unlimited game play without heating your laptop. And, with the stable Wi-fi 6 connectivity, you can enjoy an uninterrupted gaming experience.",
      "price": "₹1,07,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/Pf7Qz1bV/msi-crosshair.jpg",
      "rating": "4.7",
      "review": "240",
      "vendorName": "MSI India",
      "warrenty": "1 Year"
    },
    {
      "id": 22,
      "productName": "Redmibook 15 pro",
      "categoryId": "8",
      "description": "Equipped with the 11th Generation TigerLake Intel Core i5-11300H H35 processor, the RedmiBook Pro Notebook delivers superior performance. So, whether you want to use it for work or to watch videos or play games, this notebook helps meet all your computing requirements.This notebook comes with an 8 GB DDR4 RAM clocked at 3200 MHz, allowing you to run multiple applications simultaneously. And, integrated with a 512 GB SSD, this notebook lets you quickly transfer data and offers quick boot and wake-up times. ",
      "price": "₹39,990",
      "isAvailable": "In Stock",
      "productImage": "https://i.postimg.cc/SNykdzy8/redmibook-15-pro.jpg",
      "rating": "4.1",
      "review": "170",
      "vendorName": "Xiaomi India",
      "warrenty": "1 Year"
    },
    {
      "id": 24,
      "productName": "Infix",
      "categoryId": "9",  
      "description": "",
      "price": "32000",
      "isAvailable": "in stock",
      "productImage": "https://i.postimg.cc/wvVbjMS8/infix.jpg",
      "rating": "3.9",
      "review": "130",
      "vendorName": "Infix India",
      "warrenty": "1 Year"
    },
    {
      "id": "25",
      "productName": "Infix Y1",
      "categoryId": "9",
      "description": "des",
      "price": "30000",
      "isAvailable": "in stock",
      "productImage": "https://i.postimg.cc/Sx3BBXpg/infixy1.jpg",
      "rating": "4.1",
      "review": "110",
      "vendorName": "Infix India",
      "warrenty": "1 Year"
    }
  ]
}